lvx/base/Catalogs/бит_НастройкиПроизвольныхОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_НастройкиПроизвольныхОтчетов</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособКомпоновки</Name>
					<Comment>Способ компоновки источников данных</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СпособыКомпоновкиИсточниковДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеМакета</Name>
					<Comment>Хранилище макета</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматЧисел</Name>
					<Comment>Формат чисел</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Язык</Name>
					<Comment>Язык</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Языки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОтчета</Name>
					<Comment>Тип отчета</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыПроизвольныхОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксНомерОбласти</Name>
					<Comment>Максимальный номер области</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Comment>Префикс имени области</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаИмени</Name>
					<Comment>Длина имени области без префикса</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьПериод</Name>
					<Comment>Отображать период</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстанавливатьОтборПоАналитикеПравилЗаполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Удалить_ПравилаЗаполнения</Name>
					<Comment>Правила заполнения областей отчета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяОбласти</Name>
							<Comment>Имя области макета</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЯчейки</Name>
							<Comment>Вид ячейки</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыЯчеекПроизвольногоОтчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементДанных</Name>
							<Comment>Элемент данных</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЭлементыДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРесурса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Comment>Формула</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФорматЧисел</Name>
							<Comment>Формат чисел</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Comment>Параметр</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПараметра</Name>
							<Comment>Вид параметра</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыПараметровПроизвольныхОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИспользованиеАналитики</Name>
					<Comment>Использование аналитики</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяАналитики</Name>
							<Comment>Имя аналитики</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика</Name>
							<Comment>Аналитика</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СинонимАналитики</Name>
							<Comment>Синоним аналитики</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Comment>Имя поля</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Comment>Обязательная</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/Catalogs/бит_НастройкиПроизвольныхОтчетов/Forms/ФормаСозданияЭлементовАналитики/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	фКэшЗначений = Новый Структура;
	фКэшЗначений.Вставить("НастройкиАналитик", Новый Соответствие);
	
	Если Параметры.Свойство("ИспользуемаяАналитика") Тогда
	 
		Если Параметры.ИспользуемаяАналитика.Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru = 'Не настроена аналитика для отчета.';
						  	  	  |en = 'Do not set an analyst for the report'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли; 

		Для каждого КиЗ Из Параметры.ИспользуемаяАналитика Цикл

			Элементы.Аналитика.СписокВыбора.Добавить(КиЗ.Значение);

			ПарамАналитики = Новый Структура;
			ПарамАналитики.Вставить("ИмяАналитикиОтчета", КиЗ.Ключ);
			ПарамАналитики.Вставить("Аналитика"		    , КиЗ.Значение);
			ПарамАналитики.Вставить("ТипЗначения"		, ПарамАналитики.Аналитика.ТипЗначения);

			фКэшЗначений.НастройкиАналитик.Вставить(ПарамАналитики.Аналитика, ПарамАналитики);

		КонецЦикла; 

	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
	
&НаКлиенте
Процедура АналитикаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Аналитика) Тогда
		
		 ПарамАналитики = фКэшЗначений.НастройкиАналитик[Аналитика];
		 Если ПарамАналитики <> Неопределено Тогда			 
			 ЭлементыЗаполнения.ТипЗначения = ПарамАналитики.ТипЗначения;			 
		 КонецЕсли; 
		 
		 ЭлементыЗаполнения.Очистить();		
		 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлементыЗаполненияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ПроверитьВыбор(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлементыЗаполненияЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ПроверитьВыбор(ВыбранноеЗначение);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	РезДанные = Новый Структура;
	РезДанные.Вставить("ИмяАналитики", "");
	РезДанные.Вставить("Аналитика", Аналитика);
	РезДанные.Вставить("ИмяРесурса", "");
	РезДанные.Вставить("ЭлементыЗаполнения", ЭлементыЗаполнения);
	
	Если ЗначениеЗаполнено(Аналитика) Тогда
		
		ПарамАналитики = фКэшЗначений.НастройкиАналитик[Аналитика];
		Если ПарамАналитики <> Неопределено Тогда		
			РезДанные.ИмяАналитики = ПарамАналитики.ИмяАналитикиОтчета;		
		КонецЕсли; 
		
	КонецЕсли; 
	
	Закрыть(РезДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПоГруппе(Команда)
	
	Если ЗначениеЗаполнено(Аналитика) Тогда

		ПарамАналитики = фКэшЗначений.НастройкиАналитик[Аналитика];
		Если ПарамАналитики <> Неопределено Тогда

			ИмяФормыВыбора = ПолучитьИмяФормыВыбора(ПарамАналитики.ТипЗначения);

			Оповещение = Новый ОписаниеОповещения("ВыборГруппыЗавершение", ЭтотОбъект);
			РежимОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
			ОткрытьФорму(ИмяФормыВыбора,, ЭтотОбъект,,,, Оповещение, РежимОкна);
		 
		КонецЕсли;

	КонецЕсли; 
	
КонецПроцедуры

// Процедура обработчик оповещения "ВыборГруппыЗавершение".
//
// Параметры:
// ВыбЗначение - Произвольный
// ДополнительныеДанные - Структура.
//
&НаКлиенте 
Процедура ВыборГруппыЗавершение(ВыбЗначение, ДополнительныеДанные) Экспорт

	Если ВыбЗначение <> Неопределено Тогда
		ЗаполнитьПоГруппе(ВыбЗначение);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПроверитьВыбор(Знач ВыбранноеЗначение)
	
	СтандартнаяОбработка = Истина;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Для каждого Эл Из ВыбранноеЗначение Цикл
			
			Если Эл.ЭтоГруппа Тогда				
				СтандартнаяОбработка = Ложь;
				ТекстСообщения = НСтр("ru='Выбор групп не доступен.';
									  |en='Group selection is not available.'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				Прервать;				
			КонецЕсли; 
			
		КонецЦикла; 
		
	Иначе	
		
		Если ВыбранноеЗначение.ЭтоГруппа Тогда			
			СтандартнаяОбработка = Ложь;
			ТекстСообщения = НСтр("ru='Выбор групп не доступен.';en='Group selection is not available.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);			
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат СтандартнаяОбработка;
	
КонецФункции

// Функция получает имя формы выбора.
//
// Параметры:
//  ВходящееОписание - ОписаниеТипов
//
// Возвращаемое значение:
//  Строка.
//
&НаСервере
Функция ПолучитьИмяФормыВыбора(Знач ВходящееОписание)
	
	ИмяФормыВыбора = "";
	
	Имена = бит_РаботаСМетаданными.ПолучитьИмяОбъектаПоОписаниюТипов(ВходящееОписание);
	ИмяФормыВыбора = "Справочник."+Имена.Имя+".ФормаВыбораГруппы";
		
	Возврат ИмяФормыВыбора;
	
КонецФункции

// Процедура заполняет список по группе справочника. 
//
// Параметры:
//  ГруппаСтатей - СправочникСсылка.
//
&НаСервере
Процедура ЗаполнитьПоГруппе(Знач ГруппаСтатей)

	ТекТип = ТипЗнч(ГруппаСтатей);
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(ТекТип);
	
	ТекОписание = Новый ОписаниеТипов(МассивТипов);	
	Имена = бит_РаботаСМетаданными.ПолучитьИмяОбъектаПоОписаниюТипов(ТекОписание);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Группа", ГруппаСтатей);	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТабСпр.Ссылка
	|ИЗ
	|	Справочник.бит_СтатьиОборотов КАК ТабСпр
	|ГДЕ
	|	ТабСпр.Ссылка В ИЕРАРХИИ(&Группа)
	|	И ТабСпр.Ссылка <> &Группа";				   
	
	// Изменяем таблицу через источник запроса.	
	Схема = Новый СхемаЗапроса;
	Схема.УстановитьТекстЗапроса(Запрос.Текст);
	ТаблицаСхемы = Схема.ПакетЗапросов[0].ДоступныеТаблицы.Найти("Справочник."+Имена.Имя);
	Схема.ПакетЗапросов[0].Операторы[0].Источники.Заменить(0, ТаблицаСхемы); 

	Запрос.Текст = Схема.ПолучитьТекстЗапроса();		
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();	
	Пока Выборка.Следующий() Цикл
		
		Если ЭлементыЗаполнения.НайтиПоЗначению(Выборка.Ссылка) <> Неопределено 
			 ИЛИ Выборка.Ссылка.ЭтоГруппа Тогда		
			Продолжить;		
		КонецЕсли;		
		ЭлементыЗаполнения.Добавить(Выборка.Ссылка);
	
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти
